---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.Clear
source: html/3841dbf3-5b83-07a1-3d17-af0cded9f5b0.htm
---
# Autodesk.Revit.DB.DocumentSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```